### Report for environment: ndr-dev

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- access-audit-alarm in modules/lambda_alarms
- access-audit-alarm-topic in modules/sns
- access-audit-gateway in modules/gateway
- access-audit-lambda in modules/lambda
- access_audit_dynamodb_table in modules/dynamo_db
- alarm_state_history_table in modules/dynamo_db
- api_endpoint_url_ssm_parameter in modules/ssm_parameter
- auth_session_dynamodb_table in modules/dynamo_db
- auth_state_dynamodb_table in modules/dynamo_db
- authoriser-alarm in modules/lambda_alarms
- authoriser-alarm-topic in modules/sns
- authoriser-lambda in modules/lambda
- back-channel-logout-gateway in modules/gateway
- back_channel_logout_alarm in modules/lambda_alarms
- back_channel_logout_alarm_topic in modules/sns
- back_channel_logout_lambda in modules/lambda
- bulk-upload-alarm in modules/lambda_alarms
- bulk-upload-alarm-topic in modules/sns
- bulk-upload-lambda in modules/lambda
- bulk-upload-metadata-alarm in modules/lambda_alarms
- bulk-upload-metadata-alarm-topic in modules/sns
- bulk-upload-metadata-lambda in modules/lambda
- bulk-upload-report-alarm in modules/lambda_alarms
- bulk-upload-report-alarm-topic in modules/sns
- bulk-upload-report-lambda in modules/lambda
- bulk_upload_metadata_preprocessor_lambda in modules/lambda
- bulk_upload_report_dynamodb_table in modules/dynamo_db
Downloading registry.terraform.io/cloudstoragesec/cloud-storage-security/aws 1.8.7+css9.01.003 for cloud_storage_security...
- cloud_storage_security in .terraform/modules/cloud_storage_security
- cloudfront-distribution-lg in modules/cloudfront
- cloudfront_edge_dynamodb_table in modules/dynamo_db
- cloudfront_firewall_waf_v2 in modules/firewall_waf_v2
- create-doc-ref-lambda in modules/lambda
- create-token-gateway in modules/gateway
- create-token-lambda in modules/lambda
- create_doc_alarm in modules/lambda_alarms
- create_doc_alarm_topic in modules/sns
- create_document_reference_gateway in modules/gateway
- create_token-alarm in modules/lambda_alarms
- create_token-alarm_topic in modules/sns
- data-collection-alarm in modules/lambda_alarms
- data-collection-alarm-topic in modules/sns
- data-collection-lambda in modules/lambda
- delete-doc-ref-gateway in modules/gateway
- delete-doc-ref-lambda in modules/lambda
- delete-document-object-alarm in modules/lambda_alarms
- delete-document-object-alarm-topic in modules/sns
- delete-document-object-lambda in modules/lambda
- delete_doc_alarm in modules/lambda_alarms
- delete_doc_alarm_topic in modules/sns
- document-manifest-job-gateway in modules/gateway
- document-manifest-job-lambda in modules/lambda
- document-status-check-alarm in modules/lambda_alarms
- document-status-check-alarm-topic in modules/sns
- document-status-check-gateway in modules/gateway
- document-status-check-lambda in modules/lambda
- document_manifest_alarm in modules/lambda_alarms
- document_manifest_alarm_topic in modules/sns
- document_reference_dynamodb_table in modules/dynamo_db
- document_upload_check_lambda in modules/lambda
- edge-presign-lambda in modules/lambda_edge
- edge_presign_alarm in modules/lambda_alarms
- edge_presign_alarm_topic in modules/sns
- feature-flags-gateway in modules/gateway
- feature-flags-lambda in modules/lambda
- feature_flags_alarm in modules/lambda_alarms
- feature_flags_alarm_topic in modules/sns
- fhir_document_reference_gateway in modules/gateway
- firewall_waf_v2 in modules/firewall_waf_v2
- firewall_waf_v2_api in modules/firewall_waf_v2
- generate-document-manifest-alarm in modules/lambda_alarms
- generate-document-manifest-alarm-topic in modules/sns
- generate-document-manifest-lambda in modules/lambda
- generate-lloyd-george-stitch-alarm in modules/lambda_alarms
- generate-lloyd-george-stitch-alarm-topic in modules/sns
- generate-lloyd-george-stitch-lambda in modules/lambda
- get-doc-fhir-lambda in modules/lambda
- get-report-by-ods-alarm in modules/lambda_alarms
- get-report-by-ods-alarm-topic in modules/sns
- get-report-by-ods-gateway in modules/gateway
- get-report-by-ods-lambda in modules/lambda
- global_sqs_age_alarm_topic in modules/sns
- im-alerting-lambda in modules/lambda
- lambda-layer-alerting in modules/lambda_layers
- lambda-layer-core in modules/lambda_layers
- lambda-layer-data in modules/lambda_layers
- lloyd-george-stitch-gateway in modules/gateway
- lloyd-george-stitch-lambda in modules/lambda
- lloyd-george-stitch_alarm in modules/lambda_alarms
- lloyd-george-stitch_topic in modules/sns
- lloyd_george_reference_dynamodb_table in modules/dynamo_db
- login_redirect-alarm_topic in modules/sns
- login_redirect_alarm in modules/lambda_alarms
- login_redirect_lambda in modules/lambda
- logout-gateway in modules/gateway
- logout_alarm in modules/lambda_alarms
- logout_alarm_topic in modules/sns
- logout_lambda in modules/lambda
- manage-nrl-pointer-alarm in modules/lambda_alarms
- manage-nrl-pointer-alarm-topic in modules/sns
- manage-nrl-pointer-lambda in modules/lambda
- mns-dlq-alarm-topic in modules/sns
- mns-notification-alarm in modules/lambda_alarms
- mns-notification-alarm-topic in modules/sns
- mns-notification-lambda in modules/lambda
- mns_encryption_key in modules/kms
- ndr-app-config in modules/app_config
- ndr-bulk-staging-store in modules/s3
- ndr-docker-ecr-data-collection in modules/ecr
- ndr-docker-ecr-ui in modules/ecr
- ndr-document-store in modules/s3
- ndr-ecs-container-port-ssm-parameter in modules/ssm_parameter
- ndr-ecs-fargate-app in modules/ecs
- ndr-ecs-fargate-data-collection in modules/ecs
- ndr-feedback-mailbox in modules/ses
- ndr-lloyd-george-store in modules/s3
- ndr-truststore in modules/s3
- ndr-vpc-ui in modules/vpc
- ndr-zip-request-store in modules/s3
- nhs-oauth-token-generator-alarm in modules/lambda_alarms
- nhs-oauth-token-generator-alarm-topic in modules/sns
- nhs-oauth-token-generator-lambda in modules/lambda
- nrl-dlq-alarm-topic in modules/sns
- pdf-stitching-alarm-topic in modules/sns
- pdf-stitching-lambda in modules/lambda
- pdf-stitching-lambda-alarms in modules/lambda_alarms
- pdm-document-store in modules/s3
- pdm_dynamodb_table in modules/dynamo_db
- post-document-references-fhir-lambda in modules/lambda
- route53_fargate_ui in modules/route53
- search-document-references-fhir-lambda in modules/lambda
- search-document-references-gateway in modules/gateway
- search-document-references-lambda in modules/lambda
- search-patient-details-gateway in modules/gateway
- search-patient-details-lambda in modules/lambda
- search_doc_alarm in modules/lambda_alarms
- search_doc_alarm_topic in modules/sns
- search_patient_alarm in modules/lambda_alarms
- search_patient_alarm_topic in modules/sns
- send-feedback-alarm in modules/lambda_alarms
- send-feedback-alarm-topic in modules/sns
- send-feedback-gateway in modules/gateway
- send-feedback-lambda in modules/lambda
- sns_encryption_key in modules/kms
- sqs-lg-bulk-upload-invalid-queue in modules/sqs
- sqs-lg-bulk-upload-metadata-queue in modules/sqs
- sqs-mns-notification-queue in modules/sqs
- sqs-nrl-queue in modules/sqs
- sqs-stitching-queue in modules/sqs
- sqs_alarm_lambda_topic in modules/sns
- statistical-report-alarm in modules/lambda_alarms
- statistical-report-alarm-topic in modules/sns
- statistical-report-lambda in modules/lambda
- statistical-reports-store in modules/s3
- statistics_dynamodb_table in modules/dynamo_db
- stitch_metadata_reference_dynamodb_table in modules/dynamo_db
- stitching-dlq-alarm-topic in modules/sns
- toggle-bulk-upload-lambda in modules/lambda
- unstitched_lloyd_george_reference_dynamodb_table in modules/dynamo_db
- update-upload-state-gateway in modules/gateway
- update-upload-state-lambda in modules/lambda
- update_upload_state_alarm in modules/lambda_alarms
- update_upload_state_alarm_topic in modules/sns
- virus_scan_result_alarm in modules/lambda_alarms
- virus_scan_result_alarm_topic in modules/sns
- virus_scan_result_gateway in modules/gateway
- virus_scan_result_lambda in modules/lambda
- zip_store_reference_dynamodb_table in modules/dynamo_db
Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding latest version of hashicorp/random...
- Finding hashicorp/aws versions matching ">= 4.0.0, ~> 5.0"...
- Finding hashicorp/awscc versions matching ">= 0.72.1, ~> 1.0"...
- Finding latest version of hashicorp/archive...
- Finding latest version of hashicorp/time...
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/awscc v1.54.0...
- Installed hashicorp/awscc v1.54.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
- Installing hashicorp/time v0.13.1...
- Installed hashicorp/time v0.13.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (22 to add, 96 to change, 1 to destroy)</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.edge-presign-lambda.aws_lambda_function.lambda has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_EdgePresignLambda"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_EdgePresignLambda:318" -> "arn:aws:lambda:us-east-1:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_EdgePresignLambda:319"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.ndr_api_deploy must be replaced
+/- resource "aws_api_gateway_deployment" "ndr_api_deploy" {
      ~ created_date  = "2025-09-01T13:43:57Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ccy0v3rve9/" -> (known after apply)
      ~ id            = "ta6r2t" -> (known after apply)
      ~ invoke_url    = "[REDACTED_API_GATEWAY_URL]" -> (known after apply)
      ~ variables     = {
          - "deployed_at" = "2025-09-01T13:43:56Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.ndr_api will be updated in-place
  ~ resource "aws_api_gateway_stage" "ndr_api" {
      ~ deployment_id         = "ta6r2t" -> (known after apply)
        id                    = "ags-ccy0v3rve9-dev"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-lg-bulk-upload-metadata-queue.fifo' is older than '6' days."
      + alarm_name                            = "ndr-dev_lg_bulk_main_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-lg-bulk-upload-metadata-queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_lg_bulk_main_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-metadata-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_lg_bulk_main_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-metadata-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-lg-bulk-upload-metadata-queue.fifo' is older than '10' days."
      + alarm_name                            = "ndr-dev_lg_bulk_main_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-lg-bulk-upload-metadata-queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_lg_bulk_main_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-metadata-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_lg_bulk_main_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-metadata-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-lg-bulk-upload-invalid-queue' is older than '6' days."
      + alarm_name                            = "ndr-dev_lg_inv_main_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-lg-bulk-upload-invalid-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_lg_inv_main_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-invalid-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_lg_inv_main_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-invalid-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[3] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-lg-bulk-upload-invalid-queue' is older than '10' days."
      + alarm_name                            = "ndr-dev_lg_inv_main_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-lg-bulk-upload-invalid-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_lg_inv_main_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-invalid-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_lg_inv_main_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-lg-bulk-upload-invalid-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[4] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-deadletter-mns-notification-queue' is older than '6' days."
      + alarm_name                            = "ndr-dev_mns_dlq_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-deadletter-mns-notification-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_mns_dlq_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-deadletter-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_mns_dlq_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-deadletter-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[5] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-deadletter-mns-notification-queue' is older than '10' days."
      + alarm_name                            = "ndr-dev_mns_dlq_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-deadletter-mns-notification-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_mns_dlq_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-deadletter-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_mns_dlq_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-deadletter-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[6] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-mns-notification-queue' is older than '6' days."
      + alarm_name                            = "ndr-dev_mns_main_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-mns-notification-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_mns_main_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_mns_main_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[7] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-mns-notification-queue' is older than '10' days."
      + alarm_name                            = "ndr-dev_mns_main_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-mns-notification-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_mns_main_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_mns_main_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-mns-notification-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[8] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-deadletter-nrl-queue.fifo' is older than '6' days."
      + alarm_name                            = "ndr-dev_nrl_dlq_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-deadletter-nrl-queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_nrl_dlq_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-deadletter-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_nrl_dlq_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-deadletter-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[9] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-deadletter-nrl-queue.fifo' is older than '10' days."
      + alarm_name                            = "ndr-dev_nrl_dlq_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-deadletter-nrl-queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_nrl_dlq_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-deadletter-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_nrl_dlq_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-deadletter-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[10] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-nrl-queue.fifo' is older than '6' days."
      + alarm_name                            = "ndr-dev_nrl_main_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-nrl-queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_nrl_main_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_nrl_main_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[11] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-nrl-queue.fifo' is older than '10' days."
      + alarm_name                            = "ndr-dev_nrl_main_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-nrl-queue.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_nrl_main_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_nrl_main_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-nrl-queue.fifo"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[12] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-deadletter-stitching-queue' is older than '6' days."
      + alarm_name                            = "ndr-dev_stitching_dlq_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-deadletter-stitching-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_stitching_dlq_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-deadletter-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_stitching_dlq_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-deadletter-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[13] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-deadletter-stitching-queue' is older than '10' days."
      + alarm_name                            = "ndr-dev_stitching_dlq_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-deadletter-stitching-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_stitching_dlq_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-deadletter-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_stitching_dlq_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-deadletter-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[14] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-stitching-queue' is older than '6' days."
      + alarm_name                            = "ndr-dev_stitching_main_oldest_message_alarm_6d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-stitching-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_stitching_main_oldest_message_alarm_6d"
          + "alarm_group"  = "ndr-dev-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_stitching_main_oldest_message_alarm_6d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "medium"
        }
      + threshold                             = 518400
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sqs_oldest_message[15] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_oldest_message" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when a message in queue 'ndr-dev-stitching-queue' is older than '10' days."
      + alarm_name                            = "ndr-dev_stitching_main_oldest_message_alarm_10d"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "ndr-dev-stitching-queue"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 86400
      + statistic                             = "Maximum"
      + tags                                  = {
          + "Name"         = "ndr-dev_stitching_main_oldest_message_alarm_10d"
          + "alarm_group"  = "ndr-dev-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + tags_all                              = {
          + "Environment"  = "dev"
          + "Name"         = "ndr-dev_stitching_main_oldest_message_alarm_10d"
          + "Owner"        = "nhse/ndr-team"
          + "Workspace"    = "ndr-dev"
          + "alarm_group"  = "ndr-dev-stitching-queue"
          + "alarm_metric" = "ApproximateAgeOfOldestMessage"
          + "is_kpi"       = "true"
          + "severity"     = "high"
        }
      + threshold                             = 864000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_lambda_permission.sqs_im_alerting will be created
  + resource "aws_lambda_permission" "sqs_im_alerting" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "arn:aws:lambda:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_IMAlertingLambda"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSQSAlarmSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.access-audit-lambda.data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "placeholder_lambda_payload.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "placeholder_lambda.py"
      + type                = "zip"
    }

  # module.access-audit-lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.access-audit-lambda.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.access-audit-lambda.data.aws_iam_policy_document.lambda_kms_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_kms_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/83193deb-104f-4eb5-9263-30637dd3a531",
            ]
        }
    }

  # module.access-audit-lambda.data.aws_iam_policy_document.merged_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "merged_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "appconfig:StartConfigurationSession",
                              + "appconfig:GetLatestConfiguration",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:appconfig:*:*:application/cbe8t8t/environment/w3zulwr/configuration/tsaegbq"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:UpdateItem",
                              + "dynamodb:PutItem",
                              + "dynamodb:DeleteItem",
                              + "dynamodb:BatchWriteItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:Scan",
                              + "dynamodb:Query",
                              + "dynamodb:GetItem",
                              + "dynamodb:BatchGetItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata"
                        },
                      + {
                          + Action   = "dynamodb:Query"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata/index/NDRSessionIdIndex"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:UpdateItem",
                              + "dynamodb:PutItem",
                              + "dynamodb:DeleteItem",
                              + "dynamodb:BatchWriteItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.access-audit-lambda.data.aws_iam_policy_document.root_kms_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "root_kms_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowRootAccountAccess"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowLambdaExecutionRole"

          + principals {
              + identifiers = [
                  + "[REDACTED_IAM_ROLE_ARN]",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.access-audit-lambda.aws_iam_policy.combined_policies will be updated in-place
  ~ resource "aws_iam_policy" "combined_policies" {
        id               = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:policy/ndr-dev_AccessAuditLambda_combined_policy"
        name             = "ndr-dev_AccessAuditLambda_combined_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "appconfig:StartConfigurationSession",
                          - "appconfig:GetLatestConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:appconfig:*:*:application/cbe8t8t/environment/w3zulwr/configuration/tsaegbq"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AuthSessionReferenceMetadata/index/NDRSessionIdIndex"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:table/ndr-dev_AccessAudit"
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/83193deb-104f-4eb5-9263-30637dd3a531"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.access-audit-lambda.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ndr-dev_lambda_execution_role_AccessAuditLambda"
        name                  = "ndr-dev_lambda_execution_role_AccessAuditLambda"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.access-audit-lambda.aws_iam_role_policy.lambda_kms_access will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda_kms_access" {
        id          = "ndr-dev_lambda_execution_role_AccessAuditLambda:lambda_kms_usage"
        name        = "lambda_kms_usage"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/83193deb-104f-4eb5-9263-30637dd3a531"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.access-audit-lambda.aws_kms_key.lambda will be updated in-place
  ~ resource "aws_kms_key" "lambda" {
        id                                 = "83193deb-104f-4eb5-9263-30637dd3a531"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::[REDACTED_AWS_ACCOUNT_ID]:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowRootAccountAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "[REDACTED_IAM_ROLE_ARN]"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowLambdaExecutionRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {}
        # (14 unchanged attributes hidden)
    }

  # module.access-audit-lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_AccessAuditLambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "ACCESS_AUDIT_TABLE_NAME" = "ndr-dev_AccessAudit"
              + "APPCONFIG_APPLICATION"   = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION" = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"   = "w3zulwr"
              + "AUTH_SESSION_TABLE_NAME" = "ndr-dev_AuthSessionReferenceMetadata"
              + "WORKSPACE"               = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.authoriser-lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_AuthoriserLambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "APPCONFIG_APPLICATION"          = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION"        = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"          = "w3zulwr"
              + "AUTH_SESSION_TABLE_NAME"        = "ndr-dev_AuthSessionReferenceMetadata"
              + "SSM_PARAM_JWT_TOKEN_PUBLIC_KEY" = "jwt_token_public_key"
              + "WORKSPACE"                      = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.back_channel_logout_lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_BackChannelLogoutHandler"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "APPCONFIG_APPLICATION"          = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION"        = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"          = "w3zulwr"
              + "AUTH_DYNAMODB_NAME"             = "ndr-dev_AuthSessionReferenceMetadata"
              + "ENVIRONMENT"                    = "dev"
              + "OIDC_CALLBACK_URL"              = "https://ndr-dev.access-request-fulfilment.patient-deductions.nhs.uk/auth-callback"
              + "SSM_PARAM_JWT_TOKEN_PUBLIC_KEY" = "jwt_token_public_key"
              + "WORKSPACE"                      = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.bulk-upload-lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_BulkUploadLambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "APIM_API_URL"               = (sensitive value)
              + "APPCONFIG_APPLICATION"      = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION"    = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"      = "w3zulwr"
              + "BULK_UPLOAD_DYNAMODB_NAME"  = "ndr-dev_BulkUploadReport"
              + "INVALID_SQS_QUEUE_URL"      = "https://sqs.eu-west-2.amazonaws.com/[REDACTED_AWS_ACCOUNT_ID]/ndr-dev-lg-bulk-upload-invalid-queue"
              + "LLOYD_GEORGE_BUCKET_NAME"   = "ndr-dev-lloyd-george-store"
              + "LLOYD_GEORGE_DYNAMODB_NAME" = "ndr-dev_LloydGeorgeReferenceMetadata"
              + "METADATA_SQS_QUEUE_URL"     = "https://sqs.eu-west-2.amazonaws.com/[REDACTED_AWS_ACCOUNT_ID]/ndr-dev-lg-bulk-upload-metadata-queue.fifo"
              + "PDF_STITCHING_SQS_URL"      = "https://sqs.eu-west-2.amazonaws.com/[REDACTED_AWS_ACCOUNT_ID]/ndr-dev-stitching-queue"
              + "PDS_FHIR_IS_STUBBED"        = "false"
              + "STAGING_STORE_BUCKET_NAME"  = "ndr-dev-staging-bulk-store"
              + "WORKSPACE"                  = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.bulk-upload-metadata-lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_BulkUploadMetadataLambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "APPCONFIG_APPLICATION"     = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION"   = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"     = "w3zulwr"
              + "METADATA_SQS_QUEUE_URL"    = "https://sqs.eu-west-2.amazonaws.com/[REDACTED_AWS_ACCOUNT_ID]/ndr-dev-lg-bulk-upload-metadata-queue.fifo"
              + "STAGING_STORE_BUCKET_NAME" = "ndr-dev-staging-bulk-store"
              + "WORKSPACE"                 = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.bulk-upload-report-lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_BulkUploadReportLambda"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "APPCONFIG_APPLICATION"      = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION"    = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"      = "w3zulwr"
              + "BULK_UPLOAD_DYNAMODB_NAME"  = "ndr-dev_BulkUploadReport"
              + "STATISTICAL_REPORTS_BUCKET" = "ndr-dev-statistical-reports"
              + "WORKSPACE"                  = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.bulk_upload_metadata_preprocessor_lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_BulkUploadMetadataPreprocessor"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          + variables = {
              + "APPCONFIG_APPLICATION"     = "cbe8t8t"
              + "APPCONFIG_CONFIGURATION"   = "tsaegbq"
              + "APPCONFIG_ENVIRONMENT"     = "w3zulwr"
              + "STAGING_STORE_BUCKET_NAME" = "ndr-dev-staging-bulk-store"
              + "WORKSPACE"                 = "ndr-dev"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.create-doc-ref-lambda.data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "placeholder_lambda_payload.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "placeholder_lambda.py"
      + type                = "zip"
    }

  # module.create-doc-ref-lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.create-doc-ref-lambda.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.create-doc-ref-lambda.data.aws_iam_policy_document.lambda_kms_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_kms_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:key/2ad7448c-e745-479d-83dc-0b80eda9069a",
            ]
        }
    }

  # module.create-doc-ref-lambda.data.aws_iam_policy_document.merged_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "merged_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:List*",
                              + "s3:Get*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::ndr-dev-staging-bulk-store/*",
                              + "arn:aws:s3:::ndr-dev-staging-bulk-store",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:RestoreObject",
                              + "s3:Put*",
                              + "s3:Delete*",
                              + "s3:AbortMultipartUpload",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::ndr-dev-staging-bulk-store/*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:RestoreObject",
                              + "s3:Put*",
                              + "s3:Delete*",
                              + "s3:AbortMultipartUpload",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::ndr-dev-lloyd-george-store/*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:List*",
                              + "s3:Get*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::ndr-dev-lloyd-george-store/*",
                              + "arn:aws:s3:::ndr-dev-lloyd-george-store",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:List*",
                              + "s3:Get*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::ndr-dev-ndr-document-store/*",
                              + "arn:aws:s3:::ndr-dev-ndr-document-store",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:RestoreObject",
                              + "s3:Put*",
                              + "s3:Delete*",
                              + "s3:AbortMultipartUpload",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::ndr-dev-ndr-document-store/*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "dynamodb:UpdateItem",
                              + "dynamodb:PutItem",
                              + "dynamodb:DeleteItem",
        
(truncated - see workflow logs for full output)
```

</details>